sdaiCreateADB(SdaiPrimitiveType,BTEllipsis)
\details
Creates an Attribute Data Block (ADB) instance with a specified type and value presets.
ADB instance should be explicitly deleted by user.
\param valueType [in] A type of the initial values.
\returns An identifier of the created ADB if it was successfully created; otherwise, the function returns the NULL value.
\remarks
Possible error codes:
* sdaiSS_NOPN - Session is not open.
* sdaiVT_NVLD - Value type invalid.
* sdaiSY_ERR - Underlying system error.
\code
valueADB = sdaiCreateADB(sdaiREAL, 25.4);
...
sdaiDeleteADB(valueADB);